Revit 2024 API
PDFExportOptions.GetNamingRule Method
 Gets a copy of the naming rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public IList<TableCellCombinedParameterData> GetNamingRule()
Visual Basic
Public Function GetNamingRule As IList(Of TableCellCombinedParameterData)
Visual C++
public:
IList<TableCellCombinedParameterData^>^ GetNamingRule()
Return Value
 The naming rule.
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace